/**
 * 构建生成各种形状的方块
 */
function Box() {
}

// 每一格的间距，即每一个小方块的尺寸
Space = 20;

// 各种方块形状的编号，0代表没有形状
NoShape = 0;
// 各种方块形状的数据描述
Shapes = [
	[ [0,0], [0,0], [0,0], [0,0] ],
	[ [0,-1], [0,0], [1,0], [1,1] ],
	[ [0,-1], [0,0], [-1,0], [-1,0] ],
	[ [0,-1], [0,0], [0,1], [0,2] ],
	[ [-1,0], [0,0], [1,0], [0,1] ],
	[ [0,0], [1,0], [0,1], [1,1] ],
	[ [-1,-1], [0,-1], [0,0], [0,1] ],
	[ [1,-1], [0,-1], [0,0], [0,1] ]
];
// 各种方块形状的颜色
Colors = ["black", "fuchsia", "#cff", "red", "orange", "aqua", "green", "yellow"];

// 产生一个新的方块形状
Box.prototype.create = function() {
	// 随机选择一个形状方块
	this.shape_id = Math.floor(Math.random() * 7) + 1; //生成1~7的数
	this.shape = Shapes[this.shape_id]; // 存储方块的形状
	this.color = Colors[this.shape_id]; // 存储方块的颜色
}

